----------------------------------------------------------------
        Layer (type)               Output Shape         Param # 
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792 
       BatchNorm2d-2         [-1, 64, 224, 224]             128 
            Conv2d-3         [-1, 64, 224, 224]          36,928 
       BatchNorm2d-4         [-1, 64, 224, 224]             128 
             Block-5         [-1, 64, 224, 224]               0 
            Conv2d-6         [-1, 64, 112, 112]             640 
            Conv2d-7        [-1, 128, 112, 112]           8,320 
       BatchNorm2d-8        [-1, 128, 112, 112]             256 
            Conv2d-9        [-1, 128, 112, 112]           1,280 
           Conv2d-10        [-1, 128, 112, 112]          16,512 
      BatchNorm2d-11        [-1, 128, 112, 112]             256 
            Block-12        [-1, 128, 112, 112]               0
           Conv2d-13          [-1, 128, 56, 56]           1,280
           Conv2d-14          [-1, 256, 56, 56]          33,024
      BatchNorm2d-15          [-1, 256, 56, 56]             512
           Conv2d-16          [-1, 256, 56, 56]           2,560
           Conv2d-17          [-1, 256, 56, 56]          65,792
      BatchNorm2d-18          [-1, 256, 56, 56]             512
            Block-19          [-1, 256, 56, 56]               0
           Conv2d-20          [-1, 256, 28, 28]           2,560
           Conv2d-21          [-1, 512, 28, 28]         131,584
      BatchNorm2d-22          [-1, 512, 28, 28]           1,024
           Conv2d-23          [-1, 512, 28, 28]           5,120
           Conv2d-24          [-1, 512, 28, 28]         262,656
      BatchNorm2d-25          [-1, 512, 28, 28]           1,024
            Block-26          [-1, 512, 28, 28]               0
           Conv2d-27          [-1, 512, 14, 14]           5,120
           Conv2d-28         [-1, 1024, 14, 14]         525,312
      BatchNorm2d-29         [-1, 1024, 14, 14]           2,048
           Conv2d-30         [-1, 1024, 14, 14]          10,240
           Conv2d-31         [-1, 1024, 14, 14]       1,049,600
      BatchNorm2d-32         [-1, 1024, 14, 14]           2,048
            Block-33         [-1, 1024, 14, 14]               0
  ConvTranspose2d-34          [-1, 512, 28, 28]       4,719,104
           Conv2d-35         [-1, 1024, 28, 28]          10,240
           Conv2d-36          [-1, 512, 28, 28]         524,800
      BatchNorm2d-37          [-1, 512, 28, 28]           1,024
           Conv2d-38          [-1, 512, 28, 28]           5,120
           Conv2d-39          [-1, 512, 28, 28]         262,656
      BatchNorm2d-40          [-1, 512, 28, 28]           1,024
            Block-41          [-1, 512, 28, 28]               0
  ConvTranspose2d-42          [-1, 256, 56, 56]       1,179,904
           Conv2d-43          [-1, 512, 56, 56]           5,120
           Conv2d-44          [-1, 256, 56, 56]         131,328
      BatchNorm2d-45          [-1, 256, 56, 56]             512
           Conv2d-46          [-1, 256, 56, 56]           2,560
           Conv2d-47          [-1, 256, 56, 56]          65,792
      BatchNorm2d-48          [-1, 256, 56, 56]             512
            Block-49          [-1, 256, 56, 56]               0
  ConvTranspose2d-50        [-1, 128, 112, 112]         295,040
           Conv2d-51        [-1, 256, 112, 112]           2,560
           Conv2d-52        [-1, 128, 112, 112]          32,896
      BatchNorm2d-53        [-1, 128, 112, 112]             256
           Conv2d-54        [-1, 128, 112, 112]           1,280
           Conv2d-55        [-1, 128, 112, 112]          16,512
      BatchNorm2d-56        [-1, 128, 112, 112]             256
            Block-57        [-1, 128, 112, 112]               0
  ConvTranspose2d-58         [-1, 64, 224, 224]          73,792
           Conv2d-59         [-1, 64, 224, 224]          73,792
      BatchNorm2d-60         [-1, 64, 224, 224]             128
           Conv2d-61         [-1, 64, 224, 224]          36,928
      BatchNorm2d-62         [-1, 64, 224, 224]             128
            Block-63         [-1, 64, 224, 224]               0
           Conv2d-64          [-1, 4, 224, 224]             260
             UEnc-65          [-1, 4, 224, 224]               0
           Conv2d-66         [-1, 64, 224, 224]           2,368
      BatchNorm2d-67         [-1, 64, 224, 224]             128
           Conv2d-68         [-1, 64, 224, 224]          36,928
      BatchNorm2d-69         [-1, 64, 224, 224]             128
            Block-70         [-1, 64, 224, 224]               0
           Conv2d-71         [-1, 64, 112, 112]             640
           Conv2d-72        [-1, 128, 112, 112]           8,320
      BatchNorm2d-73        [-1, 128, 112, 112]             256
           Conv2d-74        [-1, 128, 112, 112]           1,280
           Conv2d-75        [-1, 128, 112, 112]          16,512
      BatchNorm2d-76        [-1, 128, 112, 112]             256
            Block-77        [-1, 128, 112, 112]               0
           Conv2d-78          [-1, 128, 56, 56]           1,280
           Conv2d-79          [-1, 256, 56, 56]          33,024
      BatchNorm2d-80          [-1, 256, 56, 56]             512
           Conv2d-81          [-1, 256, 56, 56]           2,560
           Conv2d-82          [-1, 256, 56, 56]          65,792
      BatchNorm2d-83          [-1, 256, 56, 56]             512
            Block-84          [-1, 256, 56, 56]               0
           Conv2d-85          [-1, 256, 28, 28]           2,560
           Conv2d-86          [-1, 512, 28, 28]         131,584
      BatchNorm2d-87          [-1, 512, 28, 28]           1,024
           Conv2d-88          [-1, 512, 28, 28]           5,120
           Conv2d-89          [-1, 512, 28, 28]         262,656
      BatchNorm2d-90          [-1, 512, 28, 28]           1,024
            Block-91          [-1, 512, 28, 28]               0
           Conv2d-92          [-1, 512, 14, 14]           5,120
           Conv2d-93         [-1, 1024, 14, 14]         525,312
      BatchNorm2d-94         [-1, 1024, 14, 14]           2,048
           Conv2d-95         [-1, 1024, 14, 14]          10,240
           Conv2d-96         [-1, 1024, 14, 14]       1,049,600
      BatchNorm2d-97         [-1, 1024, 14, 14]           2,048
            Block-98         [-1, 1024, 14, 14]               0
  ConvTranspose2d-99          [-1, 512, 28, 28]       4,719,104
          Conv2d-100         [-1, 1024, 28, 28]          10,240
          Conv2d-101          [-1, 512, 28, 28]         524,800
     BatchNorm2d-102          [-1, 512, 28, 28]           1,024
          Conv2d-103          [-1, 512, 28, 28]           5,120
          Conv2d-104          [-1, 512, 28, 28]         262,656
     BatchNorm2d-105          [-1, 512, 28, 28]           1,024
           Block-106          [-1, 512, 28, 28]               0
 ConvTranspose2d-107          [-1, 256, 56, 56]       1,179,904
          Conv2d-108          [-1, 512, 56, 56]           5,120
          Conv2d-109          [-1, 256, 56, 56]         131,328
     BatchNorm2d-110          [-1, 256, 56, 56]             512
          Conv2d-111          [-1, 256, 56, 56]           2,560
          Conv2d-112          [-1, 256, 56, 56]          65,792
     BatchNorm2d-113          [-1, 256, 56, 56]             512
           Block-114          [-1, 256, 56, 56]               0
 ConvTranspose2d-115        [-1, 128, 112, 112]         295,040
          Conv2d-116        [-1, 256, 112, 112]           2,560
          Conv2d-117        [-1, 128, 112, 112]          32,896
     BatchNorm2d-118        [-1, 128, 112, 112]             256
          Conv2d-119        [-1, 128, 112, 112]           1,280
          Conv2d-120        [-1, 128, 112, 112]          16,512
     BatchNorm2d-121        [-1, 128, 112, 112]             256
           Block-122        [-1, 128, 112, 112]               0
 ConvTranspose2d-123         [-1, 64, 224, 224]          73,792
          Conv2d-124         [-1, 64, 224, 224]          73,792
     BatchNorm2d-125         [-1, 64, 224, 224]             128
          Conv2d-126         [-1, 64, 224, 224]          36,928
     BatchNorm2d-127         [-1, 64, 224, 224]             128
           Block-128         [-1, 64, 224, 224]               0
          Conv2d-129          [-1, 3, 224, 224]             195
            UDec-130          [-1, 3, 224, 224]               0
================================================================
Total params: 19,224,071
Trainable params: 19,224,071
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 1228.83
Params size (MB): 73.33
Estimated Total Size (MB): 1302.74
----------------------------------------------------------------