----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
              ReLU-2         [-1, 64, 224, 224]               0
       BatchNorm2d-3         [-1, 64, 224, 224]             128
            Conv2d-4         [-1, 64, 224, 224]          36,928
              ReLU-5         [-1, 64, 224, 224]               0
       BatchNorm2d-6         [-1, 64, 224, 224]             128
         MaxPool2d-7         [-1, 64, 112, 112]               0
            Conv2d-8        [-1, 128, 112, 112]           8,320
            Conv2d-9        [-1, 128, 112, 112]           1,280
             ReLU-10        [-1, 128, 112, 112]               0
      BatchNorm2d-11        [-1, 128, 112, 112]             256
           Conv2d-12        [-1, 128, 112, 112]          16,512
           Conv2d-13        [-1, 128, 112, 112]           1,280
             ReLU-14        [-1, 128, 112, 112]               0
      BatchNorm2d-15        [-1, 128, 112, 112]             256
        MaxPool2d-16          [-1, 128, 56, 56]               0
           Conv2d-17          [-1, 256, 56, 56]          33,024
           Conv2d-18          [-1, 256, 56, 56]           2,560
             ReLU-19          [-1, 256, 56, 56]               0
      BatchNorm2d-20          [-1, 256, 56, 56]             512
           Conv2d-21          [-1, 256, 56, 56]          65,792
           Conv2d-22          [-1, 256, 56, 56]           2,560
             ReLU-23          [-1, 256, 56, 56]               0
      BatchNorm2d-24          [-1, 256, 56, 56]             512
        MaxPool2d-25          [-1, 256, 28, 28]               0
           Conv2d-26          [-1, 512, 28, 28]         131,584
           Conv2d-27          [-1, 512, 28, 28]           5,120
             ReLU-28          [-1, 512, 28, 28]               0
      BatchNorm2d-29          [-1, 512, 28, 28]           1,024
           Conv2d-30          [-1, 512, 28, 28]         262,656
           Conv2d-31          [-1, 512, 28, 28]           5,120
             ReLU-32          [-1, 512, 28, 28]               0
      BatchNorm2d-33          [-1, 512, 28, 28]           1,024
        MaxPool2d-34          [-1, 512, 14, 14]               0
           Conv2d-35         [-1, 1024, 14, 14]         525,312
           Conv2d-36         [-1, 1024, 14, 14]          10,240
             ReLU-37         [-1, 1024, 14, 14]               0
      BatchNorm2d-38         [-1, 1024, 14, 14]           2,048
           Conv2d-39         [-1, 1024, 14, 14]       1,049,600
           Conv2d-40         [-1, 1024, 14, 14]          10,240
             ReLU-41         [-1, 1024, 14, 14]               0
      BatchNorm2d-42         [-1, 1024, 14, 14]           2,048
  ConvTranspose2d-43          [-1, 512, 28, 28]       2,097,664
           Conv2d-44          [-1, 512, 28, 28]         524,800
           Conv2d-45          [-1, 512, 28, 28]           5,120
             ReLU-46          [-1, 512, 28, 28]               0
      BatchNorm2d-47          [-1, 512, 28, 28]           1,024
           Conv2d-48          [-1, 512, 28, 28]         262,656
           Conv2d-49          [-1, 512, 28, 28]           5,120
             ReLU-50          [-1, 512, 28, 28]               0
      BatchNorm2d-51          [-1, 512, 28, 28]           1,024
  ConvTranspose2d-52          [-1, 256, 56, 56]         524,544
           Conv2d-53          [-1, 256, 56, 56]         131,328
           Conv2d-54          [-1, 256, 56, 56]           2,560
             ReLU-55          [-1, 256, 56, 56]               0
      BatchNorm2d-56          [-1, 256, 56, 56]             512
           Conv2d-57          [-1, 256, 56, 56]          65,792
           Conv2d-58          [-1, 256, 56, 56]           2,560
             ReLU-59          [-1, 256, 56, 56]               0
      BatchNorm2d-60          [-1, 256, 56, 56]             512
  ConvTranspose2d-61        [-1, 128, 112, 112]         131,200
           Conv2d-62        [-1, 128, 112, 112]          32,896
           Conv2d-63        [-1, 128, 112, 112]           1,280
             ReLU-64        [-1, 128, 112, 112]               0
      BatchNorm2d-65        [-1, 128, 112, 112]             256
           Conv2d-66        [-1, 128, 112, 112]          16,512
           Conv2d-67        [-1, 128, 112, 112]           1,280
             ReLU-68        [-1, 128, 112, 112]               0
      BatchNorm2d-69        [-1, 128, 112, 112]             256
  ConvTranspose2d-70         [-1, 64, 224, 224]          32,832
           Conv2d-71         [-1, 64, 224, 224]          73,792
             ReLU-72         [-1, 64, 224, 224]               0
      BatchNorm2d-73         [-1, 64, 224, 224]             128
           Conv2d-74         [-1, 64, 224, 224]          36,928
             ReLU-75         [-1, 64, 224, 224]               0
      BatchNorm2d-76         [-1, 64, 224, 224]             128
           Conv2d-77         [-1, 64, 224, 224]           4,160
        Softmax2d-78         [-1, 64, 224, 224]               0
    ConstantPad2d-79         [-1, 64, 230, 230]               0
             WNet-80  [[-1, 64, 224, 224], [-1, 64, 230, 230]]               0
================================================================
Total params: 6,134,720
Trainable params: 6,134,720
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 10610.50
Params size (MB): 23.40
Estimated Total Size (MB): 10634.47
----------------------------------------------------------------